# ScheduleCategory Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleCategory Property
ParameterTypeId Class See Also
---
"Category"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleCategory { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleCategory As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleCategory {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace